---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctSettings
source: html/175a76e7-84ea-6cee-fcfc-c86b552b7fcb.htm
---
# DuctSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.